Repository: nvsoftlab/dice-roller
Catalog: lib/l10n/app_*.arb
Languages: uk

# settingsScreenTitle
source: Settings
uk: Налаштування

# settingsAppearanceBgColor
source: Background Color
uk: Колір тла

# settingsAppearanceTitle
source: Appearance
uk: Вигляд

# settingsDiceSettingsTitle
source: Dice Settings
uk: Налаштування кубиків

# settingsNumberOfDices
source: Number of Dices
uk: Кількість кубиків

# settingsGeneralTitle
source: General
uk: Загальні

# settingsSoundEffects
source: Sound Effects
uk: Звукові ефекти

# settingsVibration
source: Vibration
uk: Вібрація

# settingsKeepScreenOn
source: Keep Screen On
uk: Не вимикати екран

# settingsFeedbackTitle
source: Feedback
uk: Відгук

# settingsSendFeedback
source: Send Feedback
uk: Надіслати відгук

# settingsRateThisApp
source: Rate this app
uk: Оцінити цю програму

# settingsDiceXType
source: Dice {diceNumber} Type
uk: Тип кубика {diceNumber}

# diceScreenYourScoreX
source: Your Score: {score}
uk: Ваш результат: {score}

# diceRollButtonText
source: Roll
uk: Кинути

# diceTypeD6Classic
source: D6 Classic
uk: D6 Класичний

# settingsSelectOption
source: Select an option
uk: Виберіть опцію

# scoreScreenTitle
source: Score History
uk: Історія результатів

# scoreScreenNoRolls
source: No rolls recorded yet.
uk: Жодного кидка ще не записано.

# scoreScreenTotalScore
source: Total: {score}
uk: Всього: {score}

# modalShareFeedbackTitle
source: Share Your Feedback
uk: Поділіться своїм відгуком

# modalRatingQuestion
source: How would you rate your experience with Dice Roller?
uk: Як би ви оцінили свій досвід використання Dice Roller?

# ratingPoor
source: Poor
uk: Погано

# ratingFair
source: Fair
uk: Задовільно

# ratingOkay
source: Okay
uk: Нормально

# ratingGood
source: Good
uk: Добре

# emailLabel
source: Email *
uk: Електронна пошта *

# emailHint
source: Enter your Email
uk: Введіть свою електронну пошту

# tellUsMoreLabel
source: Tell us more *
uk: Розкажіть нам більше *

# tellUsMoreHint
source: What did you like or dislike? Any suggestions for improvement?
uk: Що вам сподобалось чи не сподобалось? Є пропозиції щодо покращення?

# submitFeedbackButton
source: Submit Feedback
uk: Надіслати відгук

# submittingFeedbackButton
source: Submitting...
uk: Відправлення...

# validationPleaseEnterEmail
source: Please enter your email
uk: Будь ласка, введіть вашу електронну пошту

# validationPleaseEnterValidEmail
source: Please enter a valid email
uk: Будь ласка, введіть дійсну електронну пошту

# validationPleaseTellUsMore
source: Please tell us more
uk: Будь ласка, розкажіть більше

# feedbackSubmittedSnackbar
source: Thank you for your feedback! It helps us to improve the app.
uk: Дякуємо за ваш відгук! Це допомагає нам покращувати додаток.

# ratingRequiredError
source: Please select a rating
uk: Будь ласка, виберіть оцінку

# feedbackApiError
source: Failed to submit feedback. Please try again later.
uk: Не вдалося надіслати відгук. Будь ласка, спробуйте пізніше.

# welcomeScreenTitle
source: Welcome to DiceRoll
uk: Ласкаво просимо до DiceRoll

# welcomeScreenSubtitle
source: Your pocket dice simulator
uk: Ваш кишеньковий симулятор кубиків

# welcomeScreenHowToUseTitle
source: How to use the app:
uk: Як користуватися програмою:

# welcomeScreenFeature1Title
source: Set number of dices
uk: Встановити кількість кубиків

# welcomeScreenFeature1Description
source: Want to roll more dice? Set your preferred number in Settings via the gear icon.
uk: Хочете кидати більше кубиків? Встановіть бажану кількість у Налаштуваннях за допомогою значка шестерні.

# welcomeScreenFeature2Title
source: Choose dice type
uk: Вибрати тип кубика

# welcomeScreenFeature2Description
source: Choose between d6-classic, d4, d6, d8, d10, d12 or d20 dice in Settings by tapping the gear icon.
uk: Виберіть між класичними кубиками d6, d4, d6, d8, d10, d12 або d20 у Налаштуваннях, натиснувши на значок шестерні.

# welcomeScreenFeature3Title
source: Shake to roll
uk: Струсіть, щоб кинути

# welcomeScreenFeature3Description
source: Simply shake your phone or tap the roll button to throw your dice.
uk: Просто струсіть телефон або натисніть кнопку кидка, щоб кинути кубики.

# welcomeScreenFeature4Title
source: See rolls results
uk: Переглянути результати кидків

# welcomeScreenFeature4Description
source: Check your roll history - view the last 20 results by tapping the results icon on the left.
uk: Перевірте історію своїх кидків – перегляньте останні 20 результатів, натиснувши на значок результатів ліворуч.

# welcomeScreenLetsRollButton
source: Let's Roll
uk: Почнімо

# settingsTermsOfUse
source: Terms of Use
uk: Умови використання

# settingsPrivacyPolicy
source: Privacy Policy
uk: Політика конфіденційності
